---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.NotAllPartsWereConvertedUnsuportedFittingOffsets
source: html/ff9e5034-a6ce-b606-e912-d2fd602a1659.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.NotAllPartsWereConvertedUnsuportedFittingOffsets Property

Not all parts were converted. Eccentric transitions and taps that have offsets from the center line are unsupported and cannot be converted.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotAllPartsWereConvertedUnsuportedFittingOffsets { get; }
```